Cannot extend layer(s) of the highlighted vertically compound wall.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId VerticalLayerExtensionFailureError { get; }
  Visual Basic
Public Shared ReadOnly Property VerticalLayerExtensionFailureError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailureError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace